README.md
```mermaid
%%{init: {'theme':'neutral'}}%%
stateDiagram-v2
    state 单元格盖子 {
        coveredIdle : 被覆盖
        revealedIdle : 被揭开
        reveal : 揭开
        
        [*] --> coveredIdle
        coveredIdle --> reveal : 收到揭开信号
        reveal --> revealedIdle : 揭开动画结束
        revealedIdle --> [*] : 本轮游戏结束
    }
```
