README.md
```mermaid
%%{init: {'theme':'neutral'}}%%
stateDiagram-v2
    state 单元格旗帜 {
        float: 漂浮
        hide: 隐藏
        lift: 升旗
        putDown: 降旗
        any: 任意状态
        
        [*] --> hide
        
        hide --> lift : 收到升旗信号
        lift --> float : 升旗动画结束
        float --> putDown : 收到降旗信号
        putDown --> hide : 降旗动画结束
        
        any --> [*] : 本轮游戏结束
    }
```
