README.md
```mermaid
%%{init: {'theme':'neutral'}}%%
stateDiagram-v2
    state 单元格 {
        covered: 被覆盖
        revealed: 被揭开
        flagged: 被标记
        
        [*] --> covered
        
        covered --> revealed : 收到揭开指令
        covered --> flagged : 收到标记指令
        flagged --> covered : 收到取消标记指令
        
        revealed --> [*] : 本轮游戏结束
    }
```
